## Plan Result (Infrastructure)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 3 to add, 0 to change, 3 to destroy.</code></pre>

* Create
  * azurerm_key_vault_access_policy.implicit_managed_identity_access_policy
  * azurerm_user_assigned_identity.managed_identity
* Delete
  * module.version_reporter_key_vault.azurerm_key_vault_access_policy.implicit_managed_identity_access_policy[0]
  * module.version_reporter_key_vault.azurerm_user_assigned_identity.managed_identity[0]
* Replace
  * azurerm_cosmosdb_sql_role_assignment.this




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_cosmosdb_sql_role_assignment.this must be replaced
-/+ resource "azurerm_cosmosdb_sql_role_assignment" "this" {
      ~ id                  = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-platform-version-reporter-ptl-rg/providers/Microsoft.DocumentDB/databaseAccounts/version-reporter-ptl-cosmos/sqlRoleAssignments/5b2b9703-b122-f10e-65ac-96aa87e6ec01" -> (known after apply)
      ~ name                = "5b2b9703-b122-f10e-65ac-96aa87e6ec01" -> (known after apply)
      ~ principal_id        = "9335c0db-1949-499b-8166-cef6732b52e4" # forces replacement -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

  # azurerm_key_vault_access_policy.implicit_managed_identity_access_policy will be created
  + resource "azurerm_key_vault_access_policy" "implicit_managed_identity_access_policy" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
        ]
      + key_vault_id            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-platform-version-reporter-ptl-rg/providers/Microsoft.KeyVault/vaults/version-reporter-ptl"
      + object_id               = (known after apply)
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # azurerm_user_assigned_identity.managed_identity will be created
  + resource "azurerm_user_assigned_identity" "managed_identity" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "version-reporter-cftptl-intsvc-mi"
      + principal_id        = (known after apply)
      + resource_group_name = "managed-identities-cftptl-intsvc-rg"
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/version-reporter-services"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
          + "startupMode"  = "always"
        }
      + tenant_id           = (known after apply)
    }

  # module.version_reporter_key_vault.azurerm_key_vault_access_policy.implicit_managed_identity_access_policy[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "azurerm_key_vault_access_policy" "implicit_managed_identity_access_policy" {
      - certificate_permissions = [
          - "Get",
          - "List",
        ] -> null
      - id                      = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-platform-version-reporter-ptl-rg/providers/Microsoft.KeyVault/vaults/version-reporter-ptl/objectId/9335c0db-1949-499b-8166-cef6732b52e4" -> null
      - key_permissions         = [
          - "Get",
          - "List",
        ] -> null
      - key_vault_id            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-platform-version-reporter-ptl-rg/providers/Microsoft.KeyVault/vaults/version-reporter-ptl" -> null
      - object_id               = "9335c0db-1949-499b-8166-cef6732b52e4" -> null
      - secret_permissions      = [
          - "Get",
          - "List",
        ] -> null
      - storage_permissions     = [] -> null
      - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
        # (1 unchanged attribute hidden)
    }

  # module.version_reporter_key_vault.azurerm_user_assigned_identity.managed_identity[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "azurerm_user_assigned_identity" "managed_identity" {
      - client_id           = "9bc38d18-a9e7-4e53-8a6b-108208ffe19e" -> null
      - id                  = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/managed-identities-ptl-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/version-reporter-ptl-mi" -> null
      - location            = "uksouth" -> null
      - name                = "version-reporter-ptl-mi" -> null
      - principal_id        = "9335c0db-1949-499b-8166-cef6732b52e4" -> null
      - resource_group_name = "managed-identities-ptl-rg" -> null
      - tags                = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/version-reporter-services"
          - "businessArea" = "CFT"
          - "criticality"  = "High"
          - "environment"  = "production"
          - "startupMode"  = "always"
        } -> null
      - tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
    }

Plan: 3 to add, 0 to change, 3 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":151,"Program":"tfcmt","SHA1":"","Target":"Infrastructure","Vars":{}} -->